<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Role;

class RoleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $owner =Role::create(['name' => 'owner']);
        $admin = Role::create(['name' => 'admin']);
        $driver = Role::create(['name' => 'driver']);
        $accountant = Role::create(['name' => 'accountant']);

        $owner->givePermissionTo([
            'التقارير',
            'جميع السائقين',
            'جميع المصروفات',
            'المصروفات اليوميه',
            'العملاء',
            'الاقساط',
            'طباعه',
            'ترحيل اكسيل',
            'قسط عميل',
            'اقساط الشهر القادم',
            'الاقساط المؤخره',
            'الاقساط المدفوعه',
            
            'السائقين',
            'ادخال سائق جديد',
            'استعلام عن السائق',
        
            'المصروفات',
            'ادخال مصروف جديد',
            'استعلام عن مصروف سائق',
            
            
            'المستخدمين',
            'اضافه مستخدم جديد',
            'تعديل مستخدم',
            'حذف مستخدم',

            'صلاحيات المستخدمين',
            'اضافه دور',
            'تعديل صلاحيات مستخدم',
            'حذف صلاحيات مستخدم',

        ]);

        $admin->givePermissionTo([
            'التقارير',
            'جميع السائقين',
            'جميع المصروفات',
            'المصروفات اليوميه',
            'العملاء',
            'الاقساط',
            'طباعه',
            'ترحيل اكسيل',
            'قسط عميل',
            'اقساط الشهر القادم',
            'الاقساط المؤخره',
            'الاقساط المدفوعه',
            
            'السائقين',
            'ادخال سائق جديد',
            'استعلام عن السائق',
        
            'المصروفات',
            'ادخال مصروف جديد',
            'استعلام عن مصروف سائق',
            
            
            'المستخدمين',
            'اضافه مستخدم جديد',
            'تعديل مستخدم',
            'حذف مستخدم',

        ]);

        $driver->givePermissionTo([
            'السائقين',
            'ادخال سائق جديد',
            'استعلام عن السائق',
        
        ]);

        $accountant->givePermissionTo([
            'التقارير',
            'جميع السائقين',
            'جميع المصروفات',
            'المصروفات اليوميه',
            'العملاء',
            'الاقساط',
            'طباعه',
            'ترحيل اكسيل',
            'قسط عميل',
            'اقساط الشهر القادم',
            'الاقساط المؤخره',
            'الاقساط المدفوعه',
        ]);
    }
}